/***********************************************************************
 *@filename:MOTOR.C
 * @parameter 五线四相电机驱动函数
 * @author :mindcont
 * @date  :2015.5.124
 * @version 1.0 
 * @return  NUll
************************************************************************/

#include "include.h"

//四相五线八拍
u8 code P_Move[8]={0x1F,0x3F,0x2F,0x6F,0x4F,0xCF,0x8F,0x9F}; 
u8 code N_Move[8]={0x9F,0x8F,0xCF,0x4F,0x6F,0x2F,0x3F,0x1F}; 
u8 Speed;

/*************************************
** 函数名称: void Motor_P(void)
** 功能描述: 电机正转函数
** 入口参数: 无
** 出口参数: 无
**************************************/
void Motor_P(void)
{
	u8 i=0;
	for (i=0; i<3; i++)       //步进电机完成八拍
    {
	      P2 = P_Move[i];  //取数据
	      Delay_500Us(Speed); //调节转速
    }
}


/*************************************
** 函数名称: void Motor_N(void)
** 功能描述: 电机反转函数
** 入口参数: 无
** 出口参数: 无
**************************************/
void Motor_N(void)
{
	u8 i=0;
	for (i=0; i<8; i++)       //步进电机完成八拍
    {
	      P2 = N_Move[i];  //取数据
	      Delay_500Us(Speed);  //调节转速
    }
}